In [27]:
import pandas as pd
import sqlite3

In [28]:
con = sqlite3.connect("test.db")

In [29]:
pd.read_sql("SELECT * FROM user", con)

   id   name  age
0   1  Sasha   32
1   2   Vova   25
2   3   Anna   21
3   4  Kolya   19

In [30]:
sql = """
    SELECT user.name, language.name 
    FROM user, language, user_language
    WHERE (user.id = user_language.user_id AND
           language.id = user_language.language_id)
"""

pd.read_sql(sql, con)

    name     name
0  Sasha  spanish
1   Vova  english
2   Vova  spanish
3   Anna   french

In [31]:
df = pd.DataFrame({
    "id": [5, 6],
    "name": ["Sveta", "Galya"],
    "age": [41, 55]
})
df

   id   name  age
0   5  Sveta   41
1   6  Galya   55

In [32]:
df.to_sql("user", con=con, if_exists="append", index=False)

In [33]:
pd.read_sql('''
    SELECT *
    FROM user
''', con)

   id   name  age
0   1  Sasha   32
1   2   Vova   25
2   3   Anna   21
3   4  Kolya   19
4   5  Sveta   41
5   6  Galya   55

In [36]:
df_job = pd.DataFrame({
    "user_id": [1, 2, 3, 4],
    "job": ["Data Science", "Python programmer",
            "ML engineer", "Java programmer"]
})
df_job

   user_id                job
0        1       Data Science
1        2  Python programmer
2        3        ML engineer
3        4    Java programmer

In [ ]:
df_job.to_sql("Job", con)

In [54]:
sql = """
    SELECT user.name, language.name, user_job.job
    FROM user, user_language, language, user_job
    WHERE (user.id = user_language.user_id AND
           language.id = user_language.language_id AND
           user.id = user_job.user_id)
"""

pd.read_sql(sql, con)

    name     name                job
0  Sasha  spanish       Data Science
1   Vova  english  Python programmer
2   Vova  spanish  Python programmer
3   Anna   french        ML engineer

In [55]:
con.close()